Revit 2027 API
ExternalResourceLoadData.LoadStatus Property
 The success or failure status of the load attempt.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceLoadStatus LoadStatus { get; }
Public ReadOnly Property LoadStatus As ExternalResourceLoadStatus
	Get
public:
property ExternalResourceLoadStatus LoadStatus {
	ExternalResourceLoadStatus get ();
}
member LoadStatus : ExternalResourceLoadStatus with get
Property Value
ExternalResourceLoadStatus
See Also
Reference
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace